app/services/loans_service.rb

SELECT "loan_requests".* FROM "loan_requests" WHERE "loan_requests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "loan_requests".* FROM "loan_requests" WHERE "loan_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def repay_loan(loan_id, amount)
    loan_request = LoanRequest.find_by(id: loan_id)
    return ServiceResponse.error(payload: {}, message: "Invalid request") if loan_request.blank?