app/models/loan_request.rb

INSERT INTO "loan_requests" ("amount", "term", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 1000], ["term", 1000], ["user_id", 1], ["status", 1], ["created_at", "2024-04-20 03:11:33.098750"], ["updated_at", "2024-04-20 03:11:33.098750"]]
UPDATE "loan_requests" SET "status" = ?, "updated_at" = ?, "remaining_amount" = ? WHERE "loan_requests"."id" = ?  [["status", 3], ["updated_at", "2024-04-20 07:30:25.785689"], ["remaining_amount", 0.0], ["id", 1]]
UPDATE "loan_requests" SET "status" = ?, "updated_at" = ?, "remaining_amount" = ? WHERE "loan_requests"."id" = ?  [["status", 3], ["updated_at", "2024-04-20 07:34:06.832837"], ["remaining_amount", 0.0], ["id", 1]]
UPDATE "repayment_schedules" SET "status" = ? WHERE "repayment_schedules"."loan_request_id" = ? AND "repayment_schedules"."status" = ?  [["status", 3], ["loan_request_id", 1], ["status", 1]]
---
  def repay_equal
    ActiveRecord::Base.transaction do
      self.status = STATUS[:paid]
      self.remaining_amount = 0
      self.save
      self.repayment_schedules.pending_schedules.update_all(status: RepaymentSchedule::STATUS[:paid])

UPDATE "loan_requests" SET "updated_at" = ?, "remaining_amount" = ? WHERE "loan_requests"."id" = ?  [["updated_at", "2024-04-20 08:25:34.049083"], ["remaining_amount", 1500.0], ["id", 4]]
UPDATE "loan_requests" SET "updated_at" = ?, "remaining_amount" = ? WHERE "loan_requests"."id" = ?  [["updated_at", "2024-04-20 08:00:37.161541"], ["remaining_amount", 500.0], ["id", 1]]
---
  def repay_more_or_equal_than_scheduled(amount)
    # Always pay latest schedule
    # If amount is extra, distribute equally to remaining schedules keeping terms constant
    latest_schedule = self.repayment_schedules.pending_schedules.first

    if amount > latest_schedule.amount
      new_remaining_amount = amount - latest_schedule.amount
    else
      new_remaining_amount = latest_schedule.amount - amount
    end
    loan_remaining_amount = self.remaining_amount - amount

    ActiveRecord::Base.transaction do
      RepaymentSchedule.repay(latest_schedule.id)
      self.remaining_amount = loan_remaining_amount.round(2)
      self.status = STATUS[:paid] if loan_remaining_amount == 0
      self.save
      RepaymentSchedule.update_schedule_amount(self.id, new_remaining_amount.round(2)) if new_remaining_amount > 0

SELECT "loan_requests".* FROM "loan_requests" ORDER BY "loan_requests"."created_at" ASC
---
  def latest_installment_amount
    self.repayment_schedules.pending_schedules.first.amount

INSERT INTO "loan_requests" ("amount", "term", "user_id", "status", "created_at", "updated_at", "remaining_amount") VALUES (?, ?, ?, ?, ?, ?, ?)  [["amount", 2000.0], ["term", 4], ["user_id", 2], ["status", 1], ["created_at", "2024-04-20 08:19:27.409506"], ["updated_at", "2024-04-20 08:19:27.409506"], ["remaining_amount", 2000.0]]
---
    def create(params)
      request = LoanRequest.new(amount: params["amount"], term: params["term"],
                                user_id: params["user_id"], status: STATUS[:pending],
                                remaining_amount: params["amount"])
      request.save

SELECT "loan_requests".* FROM "loan_requests" WHERE "loan_requests"."status" = ? ORDER BY "loan_requests"."created_at" ASC  [["status", 1]]
SELECT "loan_requests".* FROM "loan_requests" WHERE "loan_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "loan_requests".* FROM "loan_requests" WHERE "loan_requests"."status" IN (?, ?, ?) AND "loan_requests"."user_id" = ? ORDER BY "loan_requests"."created_at" ASC  [["status", 2], ["status", 1], ["status", 3], ["user_id", 2]]
---
    def fetch(filters)
      loans = LoanRequest.all
      loans = loans.where(status: filters[:status]) if filters[:status].present?
      loans = loans.where(user_id: filters[:user_id]) if filters[:user_id].present?
      loans.order(:created_at).group_by(&:status)

SELECT "loan_requests".* FROM "loan_requests" WHERE "loan_requests"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "loan_requests".* FROM "loan_requests" WHERE "loan_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def fetch_loan_schedules(loan_id)
      return [] if loan_id.blank?
      loan_request = LoanRequest.find_by(id: loan_id)

      return [] if loan_request.blank?

SELECT "loan_requests".* FROM "loan_requests" WHERE "loan_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "loan_requests" SET "status" = ?, "updated_at" = ? WHERE "loan_requests"."id" = ?  [["status", 2], ["updated_at", "2024-04-20 08:06:17.428943"], ["id", 1]]
INSERT INTO "repayment_schedules" ("amount", "due_date", "loan_request_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 333.33], ["due_date", "2024-04-27 08:06:17.441442"], ["loan_request_id", 1], ["status", 1], ["created_at", "2024-04-20 08:06:17.454133"], ["updated_at", "2024-04-20 08:06:17.454133"]]
---
    def approve(loan_id)
      loan_request = LoanRequest.find_by(id: loan_id)
      return if loan_request.blank?
      return if loan_request.approved? #Just a safety check

      # Both the approval process and creation of scheduled payments, should happen together or none at all.
      # This is why they have been kept in a transaction
      ActiveRecord::Base.transaction do
        loan_request.status = STATUS["approved"]
        loan_request.save

        total_terms = loan_request.term
        count = 1
        while count <= total_terms
          RepaymentSchedule.new(amount: (loan_request.amount/total_terms.to_f).round(2),
                                due_date: Time.zone.now+count.week,
                                loan_request_id: loan_request.id,
                                status: RepaymentSchedule::STATUS[:pending]).save