app/models/repayment_schedule.rb

    def repay(schedule_id)
      schedule = RepaymentSchedule.find_by(id: schedule_id)
      return if schedule.blank?

      schedule.status = STATUS["paid"]
      schedule.save
---
SELECT "repayment_schedules".* FROM "repayment_schedules" WHERE "repayment_schedules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "repayment_schedules" SET "status" = ?, "updated_at" = ? WHERE "repayment_schedules"."id" = ?  [["status", 2], ["updated_at", "2024-04-20 07:40:01.026497"], ["id", 1]]

    def update_schedule_amount(loan_id, amount)
      schedules = RepaymentSchedule.pending_schedules.where(loan_request_id: loan_id)
      per_schedule_amount = amount/schedules.size.to_f
      schedules.each do |schedule|
        schedule.amount = (schedule.amount - per_schedule_amount).round(2)
        schedule.save
---
UPDATE "repayment_schedules" SET "amount" = ?, "updated_at" = ? WHERE "repayment_schedules"."id" = ?  [["amount", 400.0], ["updated_at", "2024-04-20 08:25:57.907894"], ["id", 9]]